<a href="https://colab.research.google.com/github/mazq-ux/MODUL-PRAKTIKUM-BASIS-DATA/blob/main/pertemuan_4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

TEST AWAL
Jawablah pertanyaan berikut dengan tulisan tangan anda sendiri pada selembar kertas,
cantumkan nama dan nim serta kelas.  
Berdasarkan skema order entry pada bab 3 jawablah pertayaan berikut ini.
1. Berikan 1 contoh perintah alter dan modify dalam satu sintaks
2. Berikan 1 contoh penggunaan drop table.
3. Berikan 1 contoh penerapan rename table





#  **1. Contoh perintah ALTER dan MODIFY dalam satu sintaks**

Contoh (misal tabel *customers*):

```sql
ALTER TABLE customers
MODIFY nama_customer VARCHAR(150),
ADD email VARCHAR(100);
```



I



# **2. Contoh penggunaan DROP TABLE**

```sql
DROP TABLE detail_order;
```





#  **3. Contoh penerapan RENAME TABLE**

```sql
RENAME TABLE orders TO transaksi_pesanan;
```
---


# **BAB 4 â€“ ALTER, MODIFY, DROP, RENAME (DDL LANJUTAN)**


BAB ini membahas perintah SQL untuk **mengubah struktur tabel** setelah tabel dibuat. Semua perintah berada dalam kategori **DDL (Data Definition Language)**.

Isi utama bab ini:

---

# **1. ALTER TABLE**

Perintah ALTER digunakan untuk memodifikasi struktur tabel tanpa harus menghapus tabel tersebut. Ada 4 tipe perubahan:

---

## **1.1 Mengubah Nama Kolom (CHANGE)**

Digunakan untuk mengganti nama kolom lama menjadi nama baru.

### **Sintaks:**

```sql
ALTER TABLE nama_tabel
CHANGE kolom_lama kolom_baru tipe_data_baru;
```

### **Contoh di modul:**

```sql
ALTER TABLE pelanggan
CHANGE alamat alamat_rumah VARCHAR(50);
```

---

## **1.2 Mengubah Tipe Data Kolom (MODIFY)**

Untuk mengubah tipe data dari kolom yang sudah ada, tanpa mengganti namanya.

### **Sintaks:**

```sql
ALTER TABLE nama_tabel
MODIFY kolom tipe_data_baru;
```

### **Contoh di modul:**

```sql
ALTER TABLE pelanggan
MODIFY alamat_rumah VARCHAR(100);
```

---

## **1.3 Menambahkan Kolom Baru (ADD)**

Untuk menambahkan satu atau lebih kolom baru ke tabel.

### **Sintaks:**

```sql
ALTER TABLE nama_tabel
ADD nama_kolom tipe_data;
```

### **Contoh di modul:**

```sql
ALTER TABLE pelanggan
ADD kecamatan VARCHAR(30);
```

---

## **1.4 Menghapus Kolom (DROP COLUMN)**

Untuk menghapus kolom dari tabel.

### **Sintaks:**

```sql
ALTER TABLE nama_tabel
DROP COLUMN nama_kolom;
```

### **Contoh di modul:**

```sql
ALTER TABLE pelanggan
DROP COLUMN kecamatan;
```

---

# **2. DROP TABLE**

Menghapus tabel beserta seluruh data dan strukturnya secara permanen.

### **Sintaks:**

```sql
DROP TABLE nama_tabel;
```

### **Contoh di modul:**

```sql
DROP TABLE barang;
```

---

# **3. RENAME TABLE**

Mengganti nama tabel tanpa mengubah kolom atau datanya.

### **Sintaks:**

```sql
RENAME TABLE nama_lama TO nama_baru;
```

### **Contoh di modul:**

```sql
RENAME TABLE pelanggan TO pelanggan_baru;
```

---

# **4. Contoh Studi Kasus (Sesuai Modul)**

Contoh berikut diambil dari database *order entry* (seperti di modul):

### **4.1 Menambah kolom telepon pada tabel supplier**

```sql
ALTER TABLE supplier
ADD telepon VARCHAR(15);
```

### **4.2 Mengubah tipe data harga pada tabel barang**

```sql
ALTER TABLE barang
MODIFY harga DECIMAL(10,2);
```

### **4.3 Menghapus kolom diskon**

```sql
ALTER TABLE barang
DROP COLUMN diskon;
```

### **4.4 Mengganti nama kolom jumlah menjadi qty**

```sql
ALTER TABLE detail_order
CHANGE jumlah qty INT;
```

---